user_text = input("Введите текст: ")
user_int_number = int(
                          input("Введите целое число: ")
)
user_float_number = float(
                          input("Введите действиетельное число: ")
)
# вопрос: корректно ли раставлены скобки для случаев, если имеется вложенность элементов в скобках?

print(f"Поьзователь ввёл текст: {user_text}, целое число: {user_int_number} и действительное число: {user_float_number}")
# вопрос: если слишком длинная строка получается, как корректно её элементы переносить на следующие строки?
