"""
7) Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное
значение. При вызове функции должен создаваться объект-генератор. Функция должна
вызываться следующим образом: f or el in fact(n). Функция отвечает за получение факториала
числа, а в цикле необходимо выводить только первые n чисел, начиная с 1! и до n!.
Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал
четырёх 4! = 1 * 2 * 3 * 4 = 24.
"""

from math import factorial
from itertools import count


def fact(n):
    """Создаёт генератор факториалов."""
    for i in count(1):
        if n >= i:
            yield factorial(i)
        else:
            break


for i in fact(4):
    print(i)
